Autodesk.Revit.DB.Fabrication.FabricationNetworkChangeService.SetRestrictGroup(System.Boolean)
Restrict the placement of parts to only use parts associated to the passed in fabrication group identifier.
Since:
2020

Autodesk.Revit.DB.Fabrication.FabricationNetworkChangeService.ChangeService(System.Collections.Generic.ISet{Autodesk.Revit.DB.ElementId},System.Int32,System.Int32,System.Boolean)
Changes the service of the selection of fabrication parts.
Remarks:
After this method has been invoked, call:
Autodesk.Revit.DB.Fabrication.FabricationNetworkChangeService.GetStraightsThatWereNotChanged to get a set of fabrication part straight element identifiers that were not changed.GetElementsThatHadFailures to get a set of fabrication part element identifiers that had failures.
selection:
The set of element identifiers of fabrication parts to change the service for.
serviceId:
The identifier of the fabrication service.
groupId:
The identifier of the fabrication group.
restrictGroup:
Restrict the placement of parts to the passed in group identifier.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The selection contains invalid elements to change.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
No fabrication configuration is loaded.
Since:
2020